Thank you for your feedback ! Every time I run a plan, I am getting a different output so I am just looking at the plan logs

**First example**

Please see the examples below - Plan: 20 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  ~ notification_channel = "arn:aws:sqs:us-west-2:946158320428:sf-snowpipe-AIDA5YS3OHMWCVTR5XHEE-YZjsweK3loK4rXlOJBWF_g" -> (known after apply)
╷
│ Warning: Failed to describe stage. Marking the resource as removed.
│ 
│   with module.snowflake_clearinghouse.snowflake_stage.pems_raw,
│   on ../../modules/snowflake-clearinghouse/main.tf line 58, in resource "snowflake_stage" "pems_raw":
│   58: resource "snowflake_stage" "pems_raw" {
│ 
│ Stage: "RAW_DEV"."CLEARINGHOUSE"."PEMS_RAW_DEV", Err: [errors.go:22] object does not exist or not authorized

**Second example**
    }

  # module.elt.module.transforming["XS"].snowflake_warehouse.this will be updated in-place
  ~ resource "snowflake_warehouse" "this" {
        id                                  = "TRANSFORMING_XS_DEV"
      ~ max_concurrency_level               = 8 -> (known after apply)
        name                                = "TRANSFORMING_XS_DEV"
      ~ statement_queued_timeout_in_seconds = 0 -> (known after apply)
      ~ statement_timeout_in_seconds        = 172800 -> (known after apply)
        # (14 unchanged attributes hidden)
    }

Plan: 13 to add, 3 to change, 0 to destroy.
╷
│ Error: open snowflake connection: 390195 (08004): The provided ID Token is invalid.
│ 
│   with provider["registry.terraform.io/snowflake-labs/snowflake"].accountadmin,
│   on main.tf line 60, in provider "snowflake":
│   60: provider "snowflake" {

